<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;


class RoomsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('rooms')->insert([
            [
                'id' => 1,
                'name' => 'Имало едно време',
                'description' => 'Имало едно време зъл магьосник на име Абрахам, който искал да властва над света завинаги. Той бил толкова могъщ, че можел постоянно да преобразява външния си вид и така никой не знаел как изглежда и не можел да го преследва. Но годините минавали и колкото повече остарявал, толкова повече Абрахам се отдалечавал от идеята за вечна власт.<br/>Разбрал, обаче, че съществува магичен философски камък, от който може да се направи елексир за безсмъртие и решил да го открадне. И така, в една непрогледна нощ, Абрахам отмъкнал философския камък и се сдобил с неограничена власт и вечен живот.<br/>Минали векове, в които злото управлявало света, а тайни ордени търсели начин да унищожат Абрахам. И днес, обаче, още се говори, че камъкът е скрит в малка стая, до която се стига през съвсем обикновен кабинет на ул.Алабин в град София. Всеки ден Абрахам излиза от там само за 1 час и този, който успее да намери пътя от кабинета до стаята с камъка, може да го унищожи и да спаси света.<br/>Стани героя, който всички чакаме, за да спаси света от злото!',
                'price' => 4100,
                'level' => '4',
                'city' => 'София',
                'address' => 'Алабин 31',
                'capacity_min' => '2',
                'capacity_max' => '6',
                'time_slot_min' => '10:00',
                'time_slot_max' => '22:00',
                'duration' => '60',
            ],
            [
                'id' => 2,
                'name' => 'Изкуствен интелект',
                'description' => 'Изкуствен интелект е високотехнологична ескейп стая с оригинални отборни загадки, автентични декори и атмосфера.<br />Историята: В близкото бъдеще хората и технологиите достигнаха до нови, невиждани величини. Създаден е Карл – първият самоусъвършенстващ се изкуствен интелект. Ще достигне ли светът до свръхпрогрес или човечеството ще бъде унищожено... Изборът е твой!<br />ВАЖНО: ‘ИЗКУСТВЕН ИНТЕЛЕКТ’ има и специална версия за деца под 15* годишна възраст. Играта е предназначена за отбори/групи от 2 до 6 човека. *(за лица между 9 и 15 години се допуска участието на 7/8 човека)<br />Стаята е подходяща за тиймбилдинги, рождени дни и отбелязване на различни поводи. Разполагаме и с допълнителна стая за бордови игри и почерпка.',
                'price' => 3500,
                'level' => '3',
                'city' => 'София',
                'address' => 'ул.Кораб планина 54A',
                'capacity_min' => '2',
                'capacity_max' => '6',
                'time_slot_min' => '12:00',
                'time_slot_max' => '20:00',
                'duration' => '66',
            ],
            [
                'id' => 3,
                'name' => 'Детектива & Maшината на времето',
                'description' => 'Когато поверяват опазването на едно нечувано изобретение в ръцете на Детектива, той разбира, че мисията му надхвърля обичайното. И се зарича да опази творението от неправилните хора… Достойни ли сте да разгадаете тайната на Машината на времето? Имате само 60 мин да влезете в ролята на детективи и да разрешите трики загадките с помощта на собствената си проницателност...<br />Ще се потопите в изтънчена ретро атмосфера, вдъхновена от велики детективи като Шерлок Холмс и Еркюл Поаро. Авторските пъзели ще предизвикат вашите организационни и екипни умения. Интериорът е подбран така, че да се почувствате в друг свят. Всъщност, може и да ви се прииска да не се връщате обратно.',
                'price' => 3800,
                'level' => '5',
                'city' => 'София',
                'address' => 'ул.Кораб планина 54A',
                'capacity_min' => '2',
                'capacity_max' => '5',
                'time_slot_min' => '09:00',
                'time_slot_max' => '21:00',
                'duration' => '60',
            ],
            [
                'id' => 4,
                'name' => 'Тайният бар на Ал Капоне',
                'description' => 'Сухият режим в САЩ - епоха на забрани, от която лошите момчета знаят как да спечелят. Ал Капоне създава престъпната си империя благодарение на търговия с контрабанден алкохол, незаконните тогава хазартни заведения и секси забавленията. Отпийте от епохата, преоткрийте лошото момче в себе си и надхитрете триковете на мафията!<br />Стаята е с продължителност 70 мин и се препоръчва за играчи на възраст 18+ подари тематични и декоративни особености и ограничен достъп до слаб лкохол. Ако искате да я посетите с деца (12+ г.), отбележете, че предпочитате цензурираната й версия. Тя е съкратена 60-минутна игра, подходяща за всички играчи на 12+ години.',
                'price' => 3000,
                'level' => '2',
                'city' => 'София',
                'address' => 'ул. Цар Самуил 50 A',
                'capacity_min' => '2',
                'capacity_max' => '8',
                'time_slot_min' => '10:00',
                'time_slot_max' => '22:00',
                'duration' => '70',
            ]
        ]);
        DB::table('images')->insert([
            [
                'room_id' => 1,
                'main_image' => true,
                'image_path' => '1.jpg'
            ],
            [
                'room_id' => 1,
                'main_image' => false,
                'image_path' => '1_1.jpg'
            ],
            [
                'room_id' => 1,
                'main_image' => false,
                'image_path' => '1_2.jpg'
            ],
            [
                'room_id' => 1,
                'main_image' => false,
                'image_path' => '1_3.jpg'
            ],
            [
                'room_id' => 1,
                'main_image' => false,
                'image_path' => '1_4.jpg'
            ],
            [
                'room_id' => 2,
                'main_image' => true,
                'image_path' => '2.jpg'
            ],
            [
                'room_id' => 3,
                'main_image' => true,
                'image_path' => '3.jpg'
            ],
            [
                'room_id' => 4,
                'main_image' => true,
                'image_path' => '4.jpg'
            ],
            [
                'room_id' => 4,
                'main_image' => false,
                'image_path' => '4_1.jpg'
            ],
            [
                'room_id' => 4,
                'main_image' => false,
                'image_path' => '4_2.jpg'
            ],
            [
                'room_id' => 4,
                'main_image' => false,
                'image_path' => '4_3.jpg'
            ]
        ]);
    }
}
